{
  "translation": {
    "cargo": "Software Developer",
    "sobre": "Full-Stack Developer with 3 years of experience, postgraduate in software architecture. I have experience in developing APIs using C# and .Net, Domain-Driven Design (DDD), Clean Architecture and Microservices, SQL, MongoDB. I also have knowledge in technologies such as Kafka, Docker, AWS and CI/CD tools. In addition, I have experience in developing visual interfaces using TypeScript, JavaScript, Angular and React.",
    "linkCurriculo": "https://drive.google.com/file/d/1oEgmVe2iLgA6UpmbK6PjT8Lhe5dZ9Tgy",
    "tecnologias": "Technologies",
    "experiencias": "Experiences",
    "tituloProjetos": "Featured Projects",
    "notfound": "Page Not Found",
    "btn": {
      "contato": "Contact me",
      "outrosProjetos": "Other projects"
    },
    "caixa-web": {
      "cargo": "Caixa Web - Full-Stack Developer",
      "ano": "June, 2023 - Present",
      "empresa": "Autoglass",
      "descricao": "I am currently working on the development of the company's billing and invoicing product using .Net, Angular, Oracle, and Kafka. I apply Domain-Driven Design (DDD) principles and Clean Architecture. I also utilize agile methodologies, including Scrum and Kanban, for project management."
    },
    "grc": {
      "cargo": "Gestão de Risco ao Crédito - Full-Stack Developer",
      "ano": "June, 2022 - June, 2023",
      "empresa": "Autoglass",
      "descricao": "I worked on the development team for the financial credit analysis product using .Net, Angular, MongoDB, and SQS. I played a crucial role in developing the automated analysis process, implementing the asynchronous queue process with SQS, and restructuring attachment storage. Additionally, we used the Scrum agile methodology."
    },
    "aksie": {
      "cargo": "Aksie - Front-end Developer",
      "ano": "March, 2023 - July, 2023",
      "empresa": "Freelance",
      "descricao": "I worked as a Front-end Developer for a financial management platform, utilizing Angular, TypeScript, and SASS technologies."
    },
    "projetos": {
      "quasar": {
        "titulo": "Quasar E-Commerce",
        "descricao": "E-commerce project developed as a team for learning purposes, utilizing Angular for the front-end and C# for the back-end."
      },
      "PicPayChallenge": {
        "titulo": "PicPayChallenge",
        "descricao": "Technical challenge at PicPay, including the implementation of Kafka and integration with PagSeguro for various payment methods."
      },
      "Aluraflix": {
        "titulo": "Aluraflix",
        "descricao": "Project developed during the fifth edition of Alura's backend challenge. Built using Angular, C#, Asp.Net, and MySQL."
      }
    }
  }
}