{
  "translation": {
      "cargo": "Desenvolvedor de Software",
      "sobre": "Desenvolvedor Full-Stack com 3 anos de experiência, pós graduado em arquitetura de software. Possuo experiência no desenvolvimento de API's utilizando C# e .Net, Design Orientado a Domínio (DDD), Clean Architecture e Microsserviços, SQL, MongoDB. Também tenho conhecimento em tecnologias como Kafka, Docker, AWS e ferramentas de CI/CD. Além disso, possuo experiência no desenvolvimento de interfaces visuais utilizando TypeScript, JavaScript, Angular e React.",
      "linkCurriculo": "https://drive.google.com/file/d/1oEgmVe2iLgA6UpmbK6PjT8Lhe5dZ9Tgy",
      "tecnologias": "Tecnologias",
      "experiencias": "Experiências",
      "tituloProjetos": "Projetos em destaque",
      "tituloArtigos": "Artigos em destaque",
      "meusProjetos": "Meus Projetos",
      "meusArtigos": "Meus Artigos",
      "notfound": "Página não encontrada",
      "btn": {
        "contato": "Entre em contato",
        "outrosProjetos": "Outros projetos",
        "outrosArtigos": "Outros artigos"
      },
      "caixa-web": {
        "cargo": "Caixa Web - Desenvolvedor Full-Stack",
        "ano": "Junho, 2023 - Atualmente",
        "empresa": "Autoglass",
        "descricao": "Atuo no time de desenvolvimento do produto de faturamento e emissão de notas da empresa utilizando .Net, Angular, Oracle e Kafka. Aplicação dos princípios de Design Orientado a Domínio (DDD) e Clean Architecture. Utilização de metodologias ágeis, incluindo Scrum e Kanban, para o gerenciamento de projetos."
      },
      "grc": {
        "cargo": "Gestão de Risco ao Crédito - Desenvolvedor Full-Stack",
        "ano": "Junho, 2022 - Junho, 2023",
        "empresa": "Autoglass",
        "descricao": "Atuei no time de desenvolvimento do produto de análise de crédito financeiro utilizando .Net, Angular, MongoDB, SQS. Desempenhei um papel crucial no desenvolvimento do processo de análise automatizada, implementando o processo assíncrono de fila com o SQS. E na reestruturação do armazenamento de anexos. Além disso, utilizávamos a metodologia ágil Scrum."
      },
      "aksie": {
        "cargo": "Aksie - Desenvolvedor Front-end",
        "ano": "Março, 2023 - Julho, 2023",
        "empresa": "Freelance",
        "descricao": "Atuei como desenvolvedor Front-end para uma plataforma de gerenciamento contábil. Utilizando as tecnologias Angular, TypeScript, SASS."
      },
      "projetos": {
        "quasar": {
          "titulo": "Quasar E-Commerce",
          "descricao": "Projeto E-commerce desenvolvido em equipe para o aprendizado. Utilizando Angular para o front-end e C# para o back-end."
        },
        "PicPayChallenge": {
          "titulo": "PicPayChallenge",
          "descricao": "Desafio técnico no PicPay, incluindo implementação do Kafka e integração com o PagSeguro para diversos métodos de pagamento."
        },
        "Aluraflix": {
          "titulo": "Aluraflix",
          "descricao": "Projeto desenvolvido durante a quinta edição do challenge backend da Alura. Desenvolvido utilizando Angular, C#, Asp.Net e MySQL."
        },
        "gerenciamentoFuncionarios": {
          "titulo": "Aluraflix",
          "descricao": "Projeto CRUD de gerenciamento de funcionários, desenvolvido utilizando Angular e Spring, com o intuito de aprendizado."
        },
        "pokedex": {
          "titulo": "Pokedex",
          "descricao": "Projeto de uma Pokedex desenvolvido utilizando Angular e a PokéApi."
        },
        "challengeBackendFinancas": {
          "titulo": "Challeng Backend Financas",
          "descricao": "Projeto desenvolvido durante a terceira edição do Challenge backend da Alura. Desenvolvido em C#, Asp.Net e MySQL."
        },
        "botJoshue": {
          "titulo": "BotJoshue",
          "descricao": "Um bot para o Discord desenvolvido utilizando JavaScript, Node.js, Discord.js e Youtube API."
        },
        "ShortUrl": {
          "titulo": "GoShort",
          "descricao": "GoShort é um serviço simples e eficiente de encurtamento de URLs, projetado para redirecionamentos rápidos."
        }
      },
      "artigos": {
        "buscaBinaria": {
          "titulo": "Algoritmos: Busca Binária",
          "descricao": "Artigo sobre o algoritmo de Busca Binária. Onde eu mostro como o algoritmo funciona, com exemplos práticos e testes em diferentes cenários. Também mostro a implementação na linguagem Golang."
        },
        "selectionSort": {
          "titulo": "Algoritmos: Selection Sort",
          "descricao": "Um artigo sobre o algoritmo Selection Sort, explicando seu funcionamento passo a passo com exemplos práticos e testes em diferentes cenários. Também inclui uma implementação em Golang."
        }
      }
  }
}